# 2. Створіть словник, ключами є слова, а значеннями – список
# слів-синонімів до нього. Програма отримує на вхід кількість слів N.
# Далі користувач вводить слова-ключі та відповідні йому синоніми.
# Передбачити:
# 1) на запит (слово) користувача вивести список синонімів;
# 2) користувач вводить речення, в якому є слова (ключі, що містяться в
# словнику). Замінити їх синонімами та вивести речення на екран.

synonyms = {
    "чудового": ["гарного", "прекрасного"],
    "сталося": ["трапилось", "приключилось"],
    "сонце": ["сонечко"],
    "тепле": ["спекотне", "гаряче"],
    "приязне": ["ласкаве", "миле"]
}
text = "Сталося це одного чудового весняного дня. " \
       "Ясне сонце було тепле й приязне."

word = input("Word: ")
print(f"Synonyms of '{word}' are {synonyms[word]} " if synonyms.get(word)
      else "Word doesn't exist")


def change_text(t, s):
    """t - text, s - a list of synonyms"""
    arr_text = t.lower().split()
    for i in range(len(arr_text)):
        w = arr_text[i].strip(".")
        if w in s:
            arr_text[i] = s[w][0]
    return " ".join(arr_text)


newText = change_text(text, synonyms)

print(newText)
